# Created 2022-10-12 Wed 18:21
#+title: README
#+date: 2022-10-12
#+author: Connor Feeley

* About
This is repository contains the sources for my personal site.

The entire site is generated by ~publish.el~ based (primarily) on the ~org~ files under ~content/~.

* Commands
** ~elisp~ snippets :noexport:
Useful ~org-mode~ function to strip ANSI color sequences from the result of a command:
#+name: strip
#+begin_src elisp :var text="\e[31mHello World\e[0m" :results none :exports none :export no
(ansi-color-apply (concat text))
#+end_src

** Nix ~devshell~ commands
Using my nix ~progenix-std~ devshell:

#+name: devshell-menu
#+BEGIN_SRC shell :results code :post strip(*this*) :exports both
nix develop ~/source/progenix-std#cf-site-shell --command menu
#+end_src

#+RESULTS: devshell-menu
#+begin_src shell
nixago: updating repositoriy files

[general commands]

  adrgen          - A command-line tool for generating and managing Architecture Decision Records
  check-the-flake - builds everything in the flake
  mdbook          - Create books from MarkDown
  menu            - prints this menu
  repo-root       - prints the repository root path
  treefmt         - one CLI to format the code tree
  wip             - alias for: git add . && git commit -m WIP

[legal]

  reuse           - A tool for compliance with the REUSE Initiative recommendations

[site]

  publish         - Generate website by calling publish.el
  readme          - Export README.org to README.md

#+end_src

#+RESULTS:
#+begin_src shell
nixago: updating repositoriy files

[general commands]

  adrgen          - A command-line tool for generating and managing Architecture Decision Records
  check-the-flake - builds everything in the flake
  mdbook          - Create books from MarkDown
  menu            - prints this menu
  repo-root       - prints the repository root path
  treefmt         - one CLI to format the code tree
  wip             - alias for: git add . && git commit -m WIP

[legal]

  reuse           - A tool for compliance with the REUSE Initiative recommendations

[site]

  publish         - Generate website by calling publish.el
  readme          - Export README.org to README.md

#+end_src

** Generate the site
Simply run ~publish~ from inside the devshell:
#+begin_src shell
publish
#+end_src

Alternatively, run the ~publish~ command from outside the devshell:
#+BEGIN_SRC shell :results output :post strip(*this*) :export code
nix develop ~/source/progenix-std#cf-site-shell --command publish
#+end_src

*** Watching for changes
It's a bit annoying having to flip to a ~vterm~ to run ~publish~. I'd prefer it if the site were automatically re-generated whenever there's a change.

~entr~ can handle this for us:
#+begin_src shell :noeval :exports code
fd . --extension=org --extension=css --extension=js | entr publish
#+end_src

** Export ~README.org~ to ~README.md~
Since sourcehut doesn't support ~org~ README files, we need to convert it manually by running the ~readme~ devshell command:
#+begin_src shell
readme
#+end_src

Alternatively, run the ~readme~ command from outside the devshell:
#+BEGIN_SRC shell :results output :post strip(*this*) :export code
nix develop ~/source/progenix-std#cf-site-shell --command readme
#+end_src

#+RESULTS:
: nixago: updating repositoriy files

* Acknowledgements
- System Crafters' (David Wilson) ~org-mode~ site: [ [[https://systemcrafters.net/][webpage]] | [[https://github.com/SystemCrafters/systemcrafters.github.io][src]] ]
- The ~std~ Nix flake framework; used for the ~progenix-std~ devshells: [ [[https://std.divnix.com/][webpage]] | [[https://github.com/divnix/std][src]] ]
